# Отчёт по итогам автоматизации

## Что было сделано:

- в ходе ознакомления с веб-сервисом было осуществлено ручное тестирование функционала для составления плана автоматизации.
- по итогам ручного тестирования было запланировано автоматизирование тестовых сценариев.
- в ходе ручного тестирования были найдены UI ошибки.
- настроен удобный запуск SUT с быстрым подключением к БД.
- составлен [план автоматизации](https://github.com/00Julie00/Diploma_for_portfolio/blob/master/Documents/Plan.md) предусматривающий 50 тестовых сценариев (4 сценария API, 46 UI сценариев).
- написаны необходимые классы для взаимодествия с элементами веб-сервиса и для управления тестовыми данными.
- тестовые данные независимы и генерируются случайно.
- автоматизированы все 50 заявленных в плане сценария.
- подключена и настроена система отчетов Gradle/Allure
- составлен [отчет](Report.md) по результату прогона тестов.
- созданы 18 [issue](https://github.com/00Julie00/Diploma_for_portfolio/issues) по найденным дефектам.


## Сработавшие риски

- Отсутствие технической документации не позволяло четко определить ожидаемый результат в тестах
- Требование поддержки двух СУБД добавило сложности в настройках запуска SUT
- Отсутствие у веб-элементов приложения тестовых атрибутов создало сложности с локаторами элеметов


## Общий итог по времени

|                                              | Запланировано, ч | Потрачено, ч |                          Обоснование расхождения                          |
|:---------------------------------------------|:----------------:|:------------:|:-------------------------------------------------------------------------:|
| Настройка SUT                                |      12          |      9       |                                                                           |
| Разработка тест-плана                        |      10          |      10      |                                                                           |
| Создание автотестов и их запуск              |      80          |      120     | Большое кол-во времени занял поиск уникальных селекторов                  |
| Создание баг-репортов                        |      10          |      12      | Доп время было потрачено на UI ошибки                                     |                                     |
| Отчёт по результатам автоматизации           |      10          |      6       |                                                                           |
| Настройка CI                                 |      8           |      -       | Не удалось корректно настроить CI. Т.к требование не было обязательным    |                                                                   |
|                                              |                  |              | для сдачи проекта, задача удалена.                                        |
|Всего                                         |     130          |      157     |                                                                           |